20220621/AccumulationRegisters/тм_ИсторияЗаказНарядовКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>тм_ИсторияЗаказНарядовКлиента</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_АвтомобилиКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

20220621/AccumulationRegisters/тм_ИсторияЗаказНарядовКлиента/Ext/ManagerModule.bsl
Процедура ЗаписатьДвижениеДокумента(ЗаказНарядОбъект) Экспорт

	ДатаЗаписи = ТекущаяДатаСеанса();
	
	ЗаказНарядОбъект.Движения.тм_ИсторияЗаказНарядовКлиента.Записывать = Истина;
	
	Движение = ЗаказНарядОбъект.Движения.тм_ИсторияЗаказНарядовКлиента.Добавить();
	Движение.Период = ДатаЗаписи;
	Движение.Автомобиль = ЗаказНарядОбъект.тм_Автомобиль;
	Движение.Контрагент = ЗаказНарядОбъект.Контрагент;
	Движение.Пробег = ЗаказНарядОбъект.тм_Пробег;
	
КонецПроцедуры
